src/InformationRegisters/РеквизитыОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>РеквизитыОбъектов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Реквизит</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>75</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/РеквизитыОбъектов/Ext/ManagerModule.bsl
#Область СлужебныеПроцедурыИФункции

// Функция, возвращает структурные единицы по объекту.
//
Функция ПолучитьСтруктурныеЕдиницыПоОбъекту(Объект, Реквизит = Неопределено, Значение = Неопределено) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Объект) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РеквизитыОбъектов.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница
	|ИЗ
	|	РегистрСведений.РеквизитыОбъектов КАК РеквизитыОбъектов
	|ГДЕ
	|	РеквизитыОбъектов.Объект = &Объект
	|	И ВЫБОР
	|			КОГДА &Реквизит <> НЕОПРЕДЕЛЕНО
	|				ТОГДА РеквизитыОбъектов.Реквизит = &Реквизит
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &Значение <> НЕОПРЕДЕЛЕНО
	|				ТОГДА РеквизитыОбъектов.Значение = &Значение
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ");
	
	Запрос.УстановитьПараметр("Объект"	, Объект);
	Запрос.УстановитьПараметр("Реквизит", Реквизит);
	Запрос.УстановитьПараметр("Значение", Значение);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("СтруктурнаяЕдиница");
	
КонецФункции

// Процедура, создает записи в регистре.
//
Процедура СоздатьЗаписиВРегистреРеквизитыОбъектов(Объект, МассивСтруктурныхЕдиниц, Реквизит, Значение) Экспорт
			
	НаборЗаписей = РегистрыСведений.РеквизитыОбъектов.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Объект.Установить(Объект);
	НаборЗаписей.Отбор.Реквизит.Установить(Реквизит);

	Для Каждого СтруктурнаяЕдиница Из МассивСтруктурныхЕдиниц Цикл
		
		Запись = НаборЗаписей.Добавить();
		Запись.СтруктурнаяЕдиница = СтруктурнаяЕдиница;
		Запись.Объект 			  = Объект;
		Запись.Реквизит		      = Реквизит;
		Запись.Значение		      = Значение;
		
	КонецЦикла;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

// Функция, делает массив записей в регистре.
//
Функция ЗаписатьМассивЗначенийРеквизита(МассивСтруктур, Объект, Реквизит) Экспорт
	
	НаборЗаписей = РегистрыСведений.РеквизитыОбъектов.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Объект.Установить(Объект);
	НаборЗаписей.Отбор.Реквизит.Установить(Реквизит);
	
	Для Каждого СтруктураЗаписи Из МассивСтруктур Цикл
		
		НоваяЗапись 				   = НаборЗаписей.Добавить();
		НоваяЗапись.СтруктурнаяЕдиница = СтруктураЗаписи.СтруктурнаяЕдиница;
		НоваяЗапись.Объект 	           = Объект;
		НоваяЗапись.Реквизит 		   = Реквизит;
		НоваяЗапись.Значение 		   = СтруктураЗаписи.Значение;
		
	КонецЦикла;
	
	НаборЗаписей.Записать();
	
КонецФункции

// Процедура, удаляет записи в регистре.
//
Процедура УдалитьЗаписиВРегистреРеквизитыОбъектов(Объект, Реквизит) Экспорт
	
	НаборЗаписей = РегистрыСведений.РеквизитыОбъектов.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Объект.Установить(Объект);
	НаборЗаписей.Отбор.Реквизит.Установить(Реквизит);
	НаборЗаписей.Записать();
	
КонецПроцедуры

// Процедура, записывает реквизит номенклатуры в регистр.
//
Процедура ЗаписатьРеквизит(СтруктурнаяЕдиница, Объект, Реквизит, Значение) Экспорт
	
	НаборЗаписей = РегистрыСведений.РеквизитыОбъектов.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Объект.Установить(Объект);
	НаборЗаписей.Отбор.СтруктурнаяЕдиница.Установить(СтруктурнаяЕдиница);
	НаборЗаписей.Отбор.Реквизит.Установить(Реквизит);
	
	НоваяЗапись	= НаборЗаписей.Добавить();
	
	НоваяЗапись.СтруктурнаяЕдиница  = СтруктурнаяЕдиница;
	НоваяЗапись.Объект		 	  	= Объект;
	НоваяЗапись.Реквизит 			= Реквизит;
	НоваяЗапись.Значение 			= Значение;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

#КонецОбласти
